cli/socat.html
<!DOCTYPE html>
<html>
<head>
<title>Socat</title>
<!-- 2018-02-06 Tue 10:34 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Socat</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 基本用法</a></li>
<li><a href="#sec-2">2. 发送文件</a>
<ul>
<li><a href="#sec-2-1">2.1. 方式一</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. 服务器端</a></li>
<li><a href="#sec-2-1-2">2.1.2. 客户端</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. 方式二</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. 服务器端</a></li>
<li><a href="#sec-2-2-2">2.2.2. 客户端</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. 读写分离</a></li>
<li><a href="#sec-4">4. TLS 连接</a>
<ul>
<li><a href="#sec-4-1">4.1. 服务器端</a></li>
<li><a href="#sec-4-2">4.2. 客户端</a></li>
</ul>
</li>
<li><a href="#sec-5">5. 监听端口</a>
<ul>
<li><a href="#sec-5-1">5.1. 监听端口，并输出到控制台</a></li>
</ul>
</li>
<li><a href="#sec-6">6. 端口重定向</a></li>
<li><a href="#sec-7">7. 发送消息</a></li>
<li><a href="#sec-8">8. Telnet</a>
<ul>
<li><a href="#sec-8-1">8.1. 服务器端</a></li>
<li><a href="#sec-8-2">8.2. 客户端</a></li>
</ul>
</li>
<li><a href="#sec-9">9. Echo Server</a></li>
<li><a href="#sec-10">10. 使用 tun/tap</a></li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Author</td>
<td class="left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="left">Date</td>
<td class="left">2018-02-06 10:34:55</td>
</tr>
</tbody>
</table>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 基本用法</a></li>
<li><a href="#sec-2">2. 发送文件</a>
<ul>
<li><a href="#sec-2-1">2.1. 方式一</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. 服务器端</a></li>
<li><a href="#sec-2-1-2">2.1.2. 客户端</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. 方式二</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. 服务器端</a></li>
<li><a href="#sec-2-2-2">2.2.2. 客户端</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. 读写分离</a></li>
<li><a href="#sec-4">4. TLS 连接</a>
<ul>
<li><a href="#sec-4-1">4.1. 服务器端</a></li>
<li><a href="#sec-4-2">4.2. 客户端</a></li>
</ul>
</li>
<li><a href="#sec-5">5. 监听端口</a>
<ul>
<li><a href="#sec-5-1">5.1. 监听端口，并输出到控制台</a></li>
</ul>
</li>
<li><a href="#sec-6">6. 端口重定向</a></li>
<li><a href="#sec-7">7. 发送消息</a></li>
<li><a href="#sec-8">8. Telnet</a>
<ul>
<li><a href="#sec-8-1">8.1. 服务器端</a></li>
<li><a href="#sec-8-2">8.2. 客户端</a></li>
</ul>
</li>
<li><a href="#sec-9">9. Echo Server</a></li>
<li><a href="#sec-10">10. 使用 tun/tap</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 基本用法</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-sh">socat [options] &lt;address1&gt; &lt;address2&gt;
</pre>
</div>

<p>
简写:
</p>

<ul class="org-ul">
<li>tcp-l: tcp-listen
</li>
<li>udp-l : udp-listen
</li>
<li>unix-l: unix-listen
</li>

<li>tcp: tcp-connect
</li>
<li>udp: udp-connect
</li>
<li>unix: unix-connect
</li>
</ul>
</div>
</div>




<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 发送文件</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 方式一</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> 服务器端</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">

<pre class="src src-sh">socat -u open:filename,binary tcp-listen:12345
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> 客户端</h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">

<pre class="src src-sh">socat -u tcp:serverip:12345 open:localfilename,create,binary
</pre>
</div>


<p>
说明:
</p>

<ul class="org-ul">
<li><code>-u</code> 表示数据单向传送，从第一个参数传递到第二个参数，如果是 <code>-U</code> 则表示从第二个参数传送到第一个参数
</li>
<li><code>binary</code> 表示以二进制方式打开文件
</li>
<li><code>create</code> 表示如果文件不存在则创建
</li>
<li>传输结束后两端均退出
</li>
</ul>
</div>
</div>
</div>



<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 方式二</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> 服务器端</h4>
<div class="outline-text-4" id="text-2-2-1">
<div class="org-src-container">

<pre class="src src-sh">socat tcp-l:12345,reuseaddr,fork open:&lt;filename&gt;
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> 客户端</h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="org-src-container">

<pre class="src src-sh">socat tcp:&lt;ip&gt;:12345 open:&lt;filename&gt;,create
</pre>
</div>
</div>
</div>
</div>
</div>



<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 读写分离</h2>
<div class="outline-text-2" id="text-3">
<p>
socat 支持打开端的读写分离，使用 !! 符号，左侧表示读，右侧表示写
</p>

<div class="org-src-container">

<pre class="src src-sh">socat open:hello.html<span style="color: #00afaf;">\!\!</span>open:log.txt,create,append tcp-listen:12345,reuseaddr,fork
</pre>
</div>


<p>
说明:
</p>

<ul class="org-ul">
<li><code>open:hello.html</code> 表示读 hello.html 文件
</li>
<li><code>open:log.txt</code> 表示收到的数据写入 log.txt 文件
</li>
<li><code>fork</code> 请求到达时，fork 一个进程进行处理
</li>
<li>在 bash 下，需要用 <code>\</code> 对 <code>!</code> 进行转义
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> TLS 连接</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 服务器端</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">

<pre class="src src-sh">socat -U openssl-listen:8443,<span style="color: #00afaf;">\</span>
         reuseaddr,<span style="color: #00afaf;">\</span>
         <span style="color: #0087ff;">cert</span>=server.crt.pem,<span style="color: #00afaf;">\</span>
         <span style="color: #0087ff;">key</span>=server.key.pem,<span style="color: #00afaf;">\</span>
         <span style="color: #0087ff;">cafile</span>=ca.pem, <span style="color: #00afaf;">\ </span> <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#24573;&#30053;&#35777;&#20070;&#26377;&#25928;&#24615;&#65306;verify=0,\</span>
         fork <span style="color: #00afaf;">\</span>
         open:&lt;filename&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 客户端</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">

<pre class="src src-sh">socat - openssl-connect:&lt;ip&gt;:&lt;port&gt;,<span style="color: #0087ff;">verify</span>=0
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 监听端口</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 监听端口，并输出到控制台</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">

<pre class="src src-sh">socat tcp-l:&lt;port&gt; -
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 端口重定向</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">

<pre class="src src-sh">socat tcp-l:80,reuseaddr,fork tcp:&lt;dst-ip&gt;:&lt;dst-port&gt;
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 发送消息</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #5f8700;">echo</span> <span style="color: #00afaf;">"content"</span> | socat - tcp-connect:1.2.3.4:12345
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Telnet</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> 服务器端</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">

<pre class="src src-sh">socat tcp-listen:8888 exec:<span style="color: #00afaf;">'bash -i'</span>,pty,setsid,stderr,<span style="color: #0087ff;">echo</span>=0
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> 客户端</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">

<pre class="src src-sh">socat readline tcp:&lt;server-ip&gt;:8888
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Echo Server</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">

<pre class="src src-sh">socat tcp-l:12345,reuseaddr,fork EXEC:cat
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> 使用 tun/tap</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">

<pre class="src src-sh">socat -u TUN:10.0.6.1/24,tun-type=tap,up -
socat -u TUN:10.0.6.1/24,iff-no-pi,up -
</pre>
</div>
</div>
</div>
</div>
</body>
</html>